tutorials/incompressible/pimpleHFDIBFoam/prescribedDiscWithCyclicBoundary/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// bodyNames ("sphere_Top" "sphere_Bot");
bodyNames ("icoSphere");
interpolationSchemes
{
  //~ U cellPointFace;
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     1;
// stepDEM     1;
geometricD (1 1 -1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain 1000;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default


outputSetup
{
    basic true;
    iB  true;
    DEM true;
    addModel false;
    parallelDEM false;
}
DEM
{
	LcCoeff 4.0;
    materials
    {
        particle
        {
            Y       6e8;
            nu      0.0;
            mu      0;
            adhN    0;
	    	eps     1;
        }
        
        wall
        {
            Y       1e8;
            nu      0.0;
            mu      0;
            adhN    0;
	    	eps     1;
        }   
    }

	cyclicPatches
	{
		outlet 
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.00 -0.02 0.0);
			neighbourPatch movingWall;
		}

		movingWall
		{
			material wall;
			nVec (0.0 1.0 0.0);
			planePoint (0.00 0.02 0.0);
			neighbourPatch outlet;
		}
	} 
    collisionPatches
    {

    }
}

virtualMesh
{
    level 4;
    charCellSize 0.001;
    recordContact false;
}

icoSphere
{

	prescribedTransRotBody
	{
		velocity (0 -0.5 0);
		omega 0;
		axis (0 0 1);
	}

	rho         rho [1 -3 0 0 0 0 0] 4000;

	refineMC 5;

	U
	{
	BC  noSlip;
	}

	bodyAddition
	{
		addModel   once;//<-constant, only once
		onceCoeffs{}
	}
		
	material particle;
//	bodyGeom convex;
	bodyGeom sphere;
	sphere
	{
		radius 0.01;
		startPosition (0 0.0 0);
	}

	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 1;
	timesToSetStatic -1;
	
}

// ************************************************************************* //

